{
  "backend/main.mo": "Motoko actor implementing user account management (register, login, logout, profile CRUD, password reset) with access control checks using a Principal-keyed map for user profiles.",
  "feature_evidence.json": "JSON report mapping feature IDs and titles to their implementing source files, component dependencies, test IDs, and confidence levels for the income tax portal project.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line descriptions of each frontend source file, covering pages, components, hooks, utilities, and styles.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark theme tokens (colors, borders, charts, sidebar) used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point titled 'Income Tax Login Portal' that mounts the React app at the #root div via main.tsx.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for home, login, register, reset-password, dashboard (auth-guarded), tax calculator, ITR forms, PAN/TAN, refund status, and news updates, all wrapped in PortalLayout.",
  "frontend/src/components/AuthGuard.tsx": "Authentication guard component that reads/writes a sessionStorage key to track login state and redirects unauthenticated users to /login.",
  "frontend/src/components/CaptchaChallenge.tsx": "Client-side CAPTCHA component that generates random arithmetic questions, validates the user's numeric answer in real time, and supports forced reset via a prop.",
  "frontend/src/components/DisclaimerBanner.tsx": "Amber banner component displaying a disclaimer that the app is informational only, with a link to the official incometax.gov.in site.",
  "frontend/src/components/NewsTicker.tsx": "Horizontally scrolling news ticker component that displays a duplicated list of tax-related announcements with a linked 'News & Updates' label badge.",
  "frontend/src/components/PortalLayout.tsx": "Defines the main portal layout component with a responsive navigation bar featuring dropdown menus, a mobile hamburger menu, disclaimer banner, and news ticker. Navigation items include internal routes and external links to the Income Tax e-filing portal.",
  "frontend/src/components/PortalNavigation.tsx": "Placeholder file that exports nothing, as navigation logic has been moved into PortalLayout.tsx.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flows, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for backend operations including fetching the caller's user profile, registering, logging in, logging out, and resetting passwords.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines a government-portal color palette (navy, saffron) as CSS custom properties with light and dark mode variants plus utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Authenticated dashboard page that fetches and displays the user's profile, renders quick-action cards for tax services, and provides a logout button that clears the session and redirects to login.",
  "frontend/src/pages/HomePage.tsx": "The main landing page displaying quick service cards (e-Filing, Tax Calculator, ITR Forms, etc.), important tax deadlines, and platform statistics with links to internal routes and external Income Tax portals.",
  "frontend/src/pages/ITRFormsPage.tsx": "A page listing all ITR forms (ITR-1 through ITR-7) with applicability details, badges, and download links pointing to the official Income Tax portal.",
  "frontend/src/pages/LoginPage.tsx": "A login page with user ID/password fields, CAPTCHA validation, password hashing, and session management that redirects to the dashboard on successful authentication.",
  "frontend/src/pages/NewsUpdatesPage.tsx": "A news and updates page displaying a list of CBDT circulars, budget announcements, advisories, and deadlines with dates, categories, badges, and links to the official portal.",
  "frontend/src/pages/PANTANServicesPage.tsx": "A page listing PAN and TAN services (apply, correct, link Aadhaar, verify, status check, instant e-PAN) with descriptions, badges, and external links to NSDL/UTIITSL and the Income Tax portal.",
  "frontend/src/pages/RefundStatusPage.tsx": "Displays an informational page about income tax refund status, including CTA buttons linking to NSDL and e-Filing portals, a step-by-step guide, and common reasons for refund delays.",
  "frontend/src/pages/RegisterPage.tsx": "Renders a user registration form with fields for name, PAN, date of birth, user ID, password, and contact info, with client-side validation and submission via a register mutation hook.",
  "frontend/src/pages/ResetPasswordPage.tsx": "Implements a multi-step password reset flow (verify identity, set new password, success) using user ID and date of birth for verification, with form validation and a reset mutation hook.",
  "frontend/src/pages/TaxCalculatorPage.tsx": "Provides an interactive income tax calculator UI with tabs for old and new tax regimes, displaying a detailed breakdown card including slab-wise tax, rebates, surcharge, and cess.",
  "frontend/src/utils/taxCalculations.ts": "Contains pure utility functions and types for computing Indian income tax under both old and new regimes for FY 2024-25, including slab-wise tax, Section 87A rebate, surcharge, and cess calculations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/src/utils/validators.ts": "Validation functions for Indian-specific form fields (PAN, mobile, DOB) plus general fields (email, password, userId), and a SHA-256 client-side password hashing utility.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based colors (navy, saffron, portal-bg), government-portal typography/font families, and accordion keyframe animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest describing a replica of India's Income Tax portal (incometax.gov.in) with its existing features, architectural notes (no backend auth, redirects to official portal), known issues, and required image assets."
}