{
  "kind": "build_request",
  "title": "India Income Tax Portal Replica with Full Navigation, Calculator & Official Links",
  "projectName": "Income Tax India Portal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a Homepage that mirrors incometax.gov.in's design, layout, and color scheme. Include a hero banner with the official portal branding (blue/navy and saffron/orange colors, Ashoka emblem, 'Income Tax Department - Government of India' header), a marquee/ticker for news & updates, and quick-access tiles for major services (e-Filing, Tax Calculator, Forms, PAN/TAN, Refund Status).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "same to same like website but in app",
          "everything same to same and totally linked with the indian goverment income tax portal"
        ]
      },
      "acceptanceCriteria": [
        "Homepage renders with navy/blue header matching incometax.gov.in branding",
        "Ashoka emblem and 'Income Tax Department - Government of India' text appears in header",
        "Scrolling news & updates ticker/marquee is visible",
        "Quick-access service tiles for e-Filing, Tax Calculator, Forms, PAN/TAN, Refund Status are displayed",
        "Footer with disclaimer and government attribution is present"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Build a top navigation bar matching the official incometax.gov.in structure with dropdown menus for: Home, About Us, e-Filing (ITR Filing, View Filed Returns, Upload Form 16), Tax Services (Tax Calculator, Form 26AS, AIS), Forms (ITR-1 through ITR-7, Form 15G/15H), Downloads, Help & FAQ. All items that require official login must open the corresponding URL on incometax.gov.in in a new tab.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ]
      },
      "acceptanceCriteria": [
        "Navigation bar has all major sections matching incometax.gov.in",
        "Dropdown menus open on hover/click for each section",
        "Each action link opens the correct incometax.gov.in URL in a new tab",
        "Navigation is responsive and collapses to a hamburger menu on mobile"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Build a Tax Calculator page supporting both Old Regime and New Regime for FY 2024-25 (AY 2025-26). Include inputs for annual income, age group (below 60, 60-80, above 80), deductions under 80C/80D/80TTA/HRA (Old Regime only), and display a detailed tax breakdown (gross income, deductions, taxable income, tax slabs, surcharge, health & education cess at 4%, and net tax payable). Show a side-by-side comparison of both regimes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "Tax Calculator (Old vs New Regime FY 2024-25)"
        ]
      },
      "acceptanceCriteria": [
        "User can select Old Regime or New Regime or view both",
        "Tax is computed correctly using FY 2024-25 slabs for both regimes",
        "Age group affects basic exemption limit (2.5L / 3L / 5L for Old Regime)",
        "New Regime uses updated slabs: 0-3L nil, 3-7L 5%, 7-10L 10%, 10-12L 15%, 12-15L 20%, above 15L 30%",
        "Standard deduction of ₹75,000 applied for New Regime",
        "4% cess applied on total tax",
        "Surcharge applied correctly for incomes above ₹50L",
        "Side-by-side comparison of tax liability under both regimes is displayed",
        "Rebate under Section 87A applied where applicable"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Create an ITR Forms Directory page listing all ITR forms (ITR-1 Sahaj, ITR-2, ITR-3, ITR-4 Sugam, ITR-5, ITR-6, ITR-7) with a brief description of who should use each form and direct download/view links pointing to the official incometax.gov.in forms page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "ITR forms directory with links to official forms"
        ]
      },
      "acceptanceCriteria": [
        "All 7 ITR forms are listed with name and applicability description",
        "Download/View button for each form links to the official government portal URL",
        "Links open in a new tab"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Create a PAN/TAN Services section page listing PAN-related services: Apply for New PAN (links to NSDL/UTI portal), Apply for Changes/Correction in PAN, Link PAN with Aadhaar, PAN Verification, Apply for TAN, TAN Verification. Each service card must have a description and a button linking to the respective official government URL (incometax.gov.in, onlineservices.nsdl.com, or tin.tin.nsdl.com as appropriate).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "PAN/TAN services section linked to official portal"
        ]
      },
      "acceptanceCriteria": [
        "All listed PAN/TAN services are shown as cards or a list",
        "Each service links to the correct official government URL in a new tab",
        "Link PAN-Aadhaar card includes the official incometax.gov.in link"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Create a Refund Status page that shows instructions on how to check income tax refund status, and includes a prominent button/link directing users to the official NSDL refund status portal (tin.tin.nsdl.com/oltas/refundstatuslogin.html) and the incometax.gov.in e-Filing portal. Display informational steps: how long refunds take, common reasons for delay, and helpline numbers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "Refund status info section redirecting to official portal"
        ]
      },
      "acceptanceCriteria": [
        "Page displays step-by-step instructions for checking refund status",
        "Button links to official NSDL refund status portal and/or incometax.gov.in",
        "Links open in a new tab",
        "Helpline number (1800 103 0025 / 1800 419 0025) is displayed"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add a News & Updates section (also appearing as a ticker on the homepage) that displays recent announcements relevant to income tax, such as filing deadlines, new circulars, and regime changes for FY 2024-25. Content should be static but realistic, mirroring the style of the official portal's updates feed. Include a 'View All' link pointing to https://www.incometax.gov.in/iec/foportal/.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ]
      },
      "acceptanceCriteria": [
        "A scrolling ticker on the homepage shows recent news items",
        "A full News & Updates page lists multiple announcements with dates",
        "'View All' link redirects to incometax.gov.in"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add a prominent 'Login to e-Filing Portal' button on the homepage and in the navigation that redirects users to https://eportal.incometax.gov.in/iec/foservicesapp/#/login in a new tab. Also add a 'Register' link redirecting to https://eportal.incometax.gov.in/iec/foservicesapp/#/register. The existing internal login/register pages can be retained for the app's own user management but the primary CTA should clearly link to the official portal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "All action buttons/links redirect to actual incometax.gov.in pages"
        ]
      },
      "acceptanceCriteria": [
        "Prominent 'Login to e-Filing Portal' button is visible on homepage and in nav",
        "Button opens https://eportal.incometax.gov.in in a new tab",
        "'Register on Portal' link is also present linking to official registration URL",
        "A disclaimer note is shown near these buttons explaining the user will be redirected to the official government portal"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Update the TanStack Router routes to include the new pages: /home (or update / to serve as the portal homepage), /tax-calculator, /itr-forms, /pan-tan-services, /refund-status, /news-updates. Ensure the PortalLayout wraps all pages and navigation links work correctly between internal pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ]
      },
      "acceptanceCriteria": [
        "All new routes are accessible via URL",
        "Navigation links correctly route between internal pages",
        "PortalLayout header and footer appear on all pages",
        "No 404 errors for any listed route"
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add a disclaimer banner/strip visible on every page stating: 'This is an informational companion app. For official tax filing and government services, visit incometax.gov.in.' with a clickable link. Style it in a government-notice style (amber/yellow background with dark text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ]
      },
      "acceptanceCriteria": [
        "Disclaimer strip is visible on every page",
        "Text includes a clickable link to incometax.gov.in",
        "Styled with amber/yellow background to clearly denote it as a notice"
      ]
    }
  ],
  "constraints": [
    "All external links to government services must open in a new tab (target='_blank' with rel='noopener noreferrer')",
    "Do not modify files in frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Use official Indian Income Tax portal color scheme: navy blue (#003366 / #1a3a6b) and saffron/orange (#FF6600 / #f47820), matching incometax.gov.in",
    "Backend data model changes should be minimal — the app is primarily a frontend replica with external links"
  ],
  "nonGoals": [
    "Actual integration with government APIs or real-time data from incometax.gov.in",
    "Real tax filing functionality — all filing actions redirect to the official portal",
    "Real PAN verification or Aadhaar linking — only redirect to official services",
    "User authentication via Internet Identity for this replica feature set",
    "Fetching live news or updates from government servers"
  ],
  "imageRequirements": {
    "required": [
      "Ashoka Chakra / Government of India emblem circular seal icon in navy blue and gold (ashoka-emblem.dim_128x128.png)",
      "Income Tax Department India header banner background with subtle watermark pattern in navy blue (itd-header-banner.dim_1200x80.png)",
      "Indian flag color strip banner — saffron, white, green horizontal stripes (flag-strip.dim_800x24.png)"
    ],
    "edits": []
  }
}